nsight-profiles/sglang_c2_burnin/bench.log
/localhome/local-triv/benchmark/sglang-env/lib/python3.12/site-packages/torch/cuda/__init__.py:61: FutureWarning: The pynvml package is deprecated. Please install nvidia-ml-py instead. If you did not install pynvml directly, please report this to the maintainers of the package that installed pynvml for you.
  import pynvml  # type: ignore[import]
benchmark_args=Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=30000, dataset_name='sharegpt', dataset_path='/localhome/local-triv/benchmark/nsight-profiles/dataset_isl1000.json', model='meta-llama/Meta-Llama-3.1-8B-Instruct', tokenizer=None, num_prompts=2, sharegpt_output_len=200, sharegpt_context_len=None, random_input_len=1024, random_output_len=1024, random_range_ratio=0.0, request_rate=inf, max_concurrency=2, output_file='/localhome/local-triv/benchmark/nsight-profiles/sglang_c2_burnin/bench.jsonl', output_details=False, disable_tqdm=False, disable_stream=False, return_logprob=False, seed=1, disable_ignore_eos=True, extra_request_body=None, apply_chat_template=False, profile=False, lora_name=None, prompt_suffix='', pd_separated=False, flush_cache=True, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256)
Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=30000, dataset_name='sharegpt', dataset_path='/localhome/local-triv/benchmark/nsight-profiles/dataset_isl1000.json', model='meta-llama/Meta-Llama-3.1-8B-Instruct', tokenizer=None, num_prompts=2, sharegpt_output_len=200, sharegpt_context_len=None, random_input_len=1024, random_output_len=1024, random_range_ratio=0.0, request_rate=inf, max_concurrency=2, output_file='/localhome/local-triv/benchmark/nsight-profiles/sglang_c2_burnin/bench.jsonl', output_details=False, disable_tqdm=False, disable_stream=False, return_logprob=False, seed=1, disable_ignore_eos=True, extra_request_body=None, apply_chat_template=False, profile=False, lora_name=None, prompt_suffix='', pd_separated=False, flush_cache=True, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256)

#Input tokens: 2002
#Output tokens: 400
Starting warmup with 1 sequences...
Warmup completed with 1 sequences. Starting main benchmark run...
100%|██████████| 2/2 [00:02<00:00,  1.21s/it]

============ Serving Benchmark Result ============
Backend:                                 sglang    
Traffic request rate:                    inf       
Max request concurrency:                 2         
Successful requests:                     2         
Benchmark duration (s):                  2.43      
Total input tokens:                      2002      
Total generated tokens:                  400       
Total generated tokens (retokenized):    400       
Request throughput (req/s):              0.82      
Input token throughput (tok/s):          823.97    
Output token throughput (tok/s):         164.63    
Total token throughput (tok/s):          988.61    
Concurrency:                             1.98      
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   2405.86   
Median E2E Latency (ms):                 2405.86   
---------------Time to First Token----------------
Mean TTFT (ms):                          141.64    
Median TTFT (ms):                        141.64    
P99 TTFT (ms):                           190.30    
---------------Inter-Token Latency----------------
Mean ITL (ms):                           11.38     
Median ITL (ms):                         11.14     
P95 ITL (ms):                            11.43     
P99 ITL (ms):                            11.55     
Max ITL (ms):                            72.17     
==================================================